$(function(){

    $("textarea.textareaChart").val("測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n測試能不能自動伸縮大小文字\n");

    $("textarea.textareaChart").css("height", $("textarea.textareaChart").prop("scrollHeight"));

});